# CannotMakePointHostedByIntersection Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PointFailures..::..CannotMakePointHostedByIntersection Property
BuiltInFailures..::..PointFailures Class See Also
---
Cannot make point hosted by intersection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotMakePointHostedByIntersection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotMakePointHostedByIntersection As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotMakePointHostedByIntersection {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PointFailures Class
Autodesk.Revit.DB Namespace